
**Terraform Cloud Plan Output**



<details><summary>Show Plan(infra/aws/prod)</summary>

```

[command]/home/runner/work/_temp/e9c814c1-ba46-4f36-83a8-5cda14b868a2/terraform-bin plan -no-color
2024-04-25T12:19:05.214Z [INFO]  Terraform version: 1.8.1
2024-04-25T12:19:05.214Z [INFO]  Go runtime version: go1.22.1
2024-04-25T12:19:05.214Z [INFO]  CLI args: []string{"/home/runner/work/_temp/e9c814c1-ba46-4f36-83a8-5cda14b868a2/terraform-bin", "plan", "-no-color"}
2024-04-25T12:19:05.214Z [INFO]  CLI command args: []string{"plan", "-no-color"}
2024-04-25T12:19:05.217Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=26e12249-dc1d-7aa7-da16-f806da1f0ed4 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate tf_aws.credentials_source=EnvConfigCredentials
2024-04-25T12:19:05.781Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=26e12249-dc1d-7aa7-da16-f806da1f0ed4 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-04-25T12:19:05.916Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=26e12249-dc1d-7aa7-da16-f806da1f0ed4 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-04-25T12:19:06.254Z [INFO]  backend/local: starting Plan operation
2024-04-25T12:19:06.705Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=195feec9-390c-f2dc-2b67-edbec05fe26a tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-04-25T12:19:06.850Z [INFO]  provider: configuring client automatic mTLS
2024-04-25T12:19:06.939Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-04-25T12:19:06.939Z
2024-04-25T12:19:07.594Z [INFO]  provider: configuring client automatic mTLS
2024-04-25T12:19:07.679Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-04-25T12:19:07.679Z
2024-04-25T12:19:07.792Z [INFO]  backend/local: plan calling Plan
2024-04-25T12:19:07.792Z [INFO]  provider: configuring client automatic mTLS
2024-04-25T12:19:07.879Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-04-25T12:19:07.879Z
2024-04-25T12:19:07.987Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved credentials: @module=aws.aws-base tf_aws.credentials_source=EnvConfigCredentials tf_mux_provider="*schema.GRPCProviderServer" tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=9bc16c88-7087-9444-2f50-ff93a430f5f0 tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 timestamp=2024-04-25T12:19:07.987Z
2024-04-25T12:19:08.654Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved caller identity from STS: tf_mux_provider="*schema.GRPCProviderServer" @module=aws.aws-base tf_req_id=9bc16c88-7087-9444-2f50-ff93a430f5f0 tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2024-04-25T12:19:08.654Z
2024-04-25T12:19:08.662Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_ecr_repository.algosolved_repository, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .image_tag_mutability: planned value cty.StringVal("MUTABLE") for a non-computed attribute
2024-04-25T12:19:08.670Z [INFO]  backend/local: plan operation completed

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.algosolved_repository will be created
  + resource "aws_ecr_repository" "algosolved_repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "algosolved"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Name"  = "algosolved"
          + "Stage" = "prod"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_ecr_repository.algosolved_repository will be created%0A  + resource "aws_ecr_repository" "algosolved_repository" {%0A      + arn                  = (known after apply)%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "MUTABLE"%0A      + name                 = "algosolved"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags_all             = {%0A          + "Name"  = "algosolved"%0A          + "Stage" = "prod"%0A        }%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 2024-04-25T12:19:05.214Z [INFO]  Terraform version: 1.8.1%0A2024-04-25T12:19:05.214Z [INFO]  Go runtime version: go1.22.1%0A2024-04-25T12:19:05.214Z [INFO]  CLI args: []string{"/home/runner/work/_temp/e9c814c1-ba46-4f36-83a8-5cda14b868a2/terraform-bin", "plan", "-no-color"}%0A2024-04-25T12:19:05.214Z [INFO]  CLI command args: []string{"plan", "-no-color"}%0A2024-04-25T12:19:05.217Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=26e12249-dc1d-7aa7-da16-f806da1f0ed4 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate tf_aws.credentials_source=EnvConfigCredentials%0A2024-04-25T12:19:05.781Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=26e12249-dc1d-7aa7-da16-f806da1f0ed4 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-04-25T12:19:05.916Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=26e12249-dc1d-7aa7-da16-f806da1f0ed4 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-04-25T12:19:06.254Z [INFO]  backend/local: starting Plan operation%0A2024-04-25T12:19:06.705Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=195feec9-390c-f2dc-2b67-edbec05fe26a tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-04-25T12:19:06.850Z [INFO]  provider: configuring client automatic mTLS%0A2024-04-25T12:19:06.939Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-04-25T12:19:06.939Z%0A2024-04-25T12:19:07.594Z [INFO]  provider: configuring client automatic mTLS%0A2024-04-25T12:19:07.679Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-04-25T12:19:07.679Z%0A2024-04-25T12:19:07.792Z [INFO]  backend/local: plan calling Plan%0A2024-04-25T12:19:07.792Z [INFO]  provider: configuring client automatic mTLS%0A2024-04-25T12:19:07.879Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-04-25T12:19:07.879Z%0A2024-04-25T12:19:07.987Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved credentials: @module=aws.aws-base tf_aws.credentials_source=EnvConfigCredentials tf_mux_provider="*schema.GRPCProviderServer" tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=9bc16c88-7087-9444-2f50-ff93a430f5f0 tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 timestamp=2024-04-25T12:19:07.987Z%0A2024-04-25T12:19:08.654Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved caller identity from STS: tf_mux_provider="*schema.GRPCProviderServer" @module=aws.aws-base tf_req_id=9bc16c88-7087-9444-2f50-ff93a430f5f0 tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2024-04-25T12:19:08.654Z%0A2024-04-25T12:19:08.662Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_ecr_repository.algosolved_repository, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .image_tag_mutability: planned value cty.StringVal("MUTABLE") for a non-computed attribute%0A2024-04-25T12:19:08.670Z [INFO]  backend/local: plan operation completed%0A
::debug::exitcode: 0

```

</details>




**Pusher: @rha6780**